function alertCTig() {
    var context = '一首歌公益平台内容发布和用户使用条款\n' +
        '\n' +
        '一首歌公益是由浙江朵朵溢善公益基金会(以下简称朵朵溢善)发起的公\n' +
        '益行动。通过对社会捐赠的一首歌及其他音乐作品在线拍卖，募集公益资金，资助有音乐才华的、符合资助条件的青少年实现音乐梦想，积极帮扶贫困边边地区音乐教育师资、硬件建设，致力于弘扬传统优秀音乐文化，促进音乐文化的多元化发展。\n' +
        '1.请您在使用本平台前仔细阅读以下各项使用条款（以下简称"条款"）。通过访问和/或使用本平台，您表示同意接受本条款的所有条件和条款。\n' +
        '2.您须承诺上传到一首歌公益平台的内容真实、合法，不会侵犯任何第三方的合法权益。您并承诺对该内容拥有完整的知识产权，或已经得到相关权利人的合法授权。您应对提供的全部内容承担一切法律责任，朵朵溢善使用您所发布的内容不会对第三方权益产生不良影响；\n' +
        '3. 您须确保上传到一首歌公益平台的内容没有任何谩骂、诅咒、诋毁、攻击内容，也没有任何含有淫秽、色情、下流、反动、扇动民族仇恨等违反国家强制性法律法规的内容；\n' +
        '4.当您阅读了本条款并上传内容后，表示您已经同意和遵守本条款，并保证上传内容符合上述规定。如果经第三举报发现您上传的内容违反了上述规定，为避免损失和不良影响的扩大，朵朵溢善有权要求您立即修正，或直接采取删除、屏蔽相应内容等必要的措施。因您在本网站上传内容而导致任何第三方提出索赔要求或衍生的任何损害或损失，朵朵溢善不承担任何责任；\n' +
        '5.在符合上述规定的情况下，您通过本平台上传的内容表示，即被视为您积极支持一首歌公益行动，讲上传内容无偿捐赠给朵朵溢善。并同意授予朵朵溢善所有上传内容的在全球范围内的免费、不可撤销、无限期的并且可转让的非独家使用权许可，朵朵溢善有权展示、散布及推广上传内容，有权对上传内容进行任何形式的复制、修改、出版、发行及以其他方式使用或者授权第三方进行复制、修改、出版、发行及以其他方式使用。朵朵溢善无须另行征得您的同意且无需向您支付任何费用；\n' +
        '\n' +
        '6、本平台不保证上传作品的安全性，请上传用户自行留存原稿，对因任何原因导致用户上传的内容灭失的情况，本平台不承担任何责任；\n' +
        '7.个人通过本平台付费下载您上传的内容参与一首歌公益行动，未经朵朵溢善许可，任何个人不得将所下载内容进行任何盈利性质或对第三方利益造成损害的活动，由此产生的一切后果由自己个人承担；\n' +
        '8、请咨询阅读本条例，如果您不认可、不接受上述条款，请不要访问和使用本平台及相关服务；\n' +
        '9、感谢您的耐心阅读，感谢您积极参与一首歌公益行动。'
    var flag = confirm(context);
}